[
    {
        "date": "2016-06-03",
        "review": "All I can say is the customer service is WAY ABOVE AND BEYOND.  First off I emailed a few places on Yelp for quotes and I got a phone call as soon as I hit send which really impressed me.  I was at work and couldn't meet until later in the day which was no problem for him.  He arrived 10 minutes earlier than the time we agreed upon so I appreciated the fact that he was prompt.  My phone had a new screen on it within 10 minutes and he was done.  He was very professional and friendly and I felt comfortable having him in my house as a single woman.  So here is where I think it gets even better.  I noticed my phone was acting off after the screen was replaced so I text him and asked if this was normal and he said it should be exactly like it was prior to it breaking.  I thought ok, it's probably just me so I would wait a day.  Well later than evening I wanted to break it again because I was so frustrated so I sent a Yelp message at some crazy hour and what do you know? First thing in the morning he calls me and texts me and said he would come back out and fix it that it may be a faulty screen.  He came to my office exactly when I asked him too and fixed my phone which is now perfect.  I guess every now and then you can get a faulty screen or something doesn't get connected back just right.  Now some people may think well it should have been right but here is the thing.  Do you know how to replace a screen in a matter of minutes?  I sure don't and I don't know anything about the process but I think it's crazy that it can be replaced so I was beyond ecstatic with how much he cared and fixed my problem right away.  It's  so hard to find good customer service, I can tell he owns and runs his business to please his customers.  I highly recommend this service to anyone who needs a screen replaced ASAP.",
        "name": "Kerri K.",
        "avatar": "\/\/s3-media1.fl.yelpcdn.com\/photo\/QRx_KZuq_2JC2fJ_qEncoA\/60s.jpg",
        "city": "San Diego, CA",
        "HDAvatar": "http:\/\/s3-media1.fl.yelpcdn.com\/photo\/QRx_KZuq_2JC2fJ_qEncoA\/ls.jpg"
    },
    {
        "date": "2016-06-02",
        "review": "Jacob is a professional fixer of iPhones. He said he has been fixing these for 6 years. My phone, 6s, need a replacement of the front screen which most of the stores don't do and Jacob just finished it in 30 mins. I will definitely call him again if I have a problem with my phones.",
        "name": "Diane G.",
        "avatar": "\/\/s3-media3.fl.yelpcdn.com\/assets\/srv0\/yelp_styleguide\/20983a63ea50\/assets\/img\/default_avatars\/user_60_square.png",
        "city": "Halifax, Canada",
        "HDAvatar": ".\/img\/anon.jpg"
    },
    {
        "date": "2016-06-02",
        "review": "Great service and very friendly.he was punctual and great job on my phone. I would definitely use him again.",
        "name": "Cassandra H.",
        "avatar": "\/\/s3-media3.fl.yelpcdn.com\/assets\/srv0\/yelp_styleguide\/20983a63ea50\/assets\/img\/default_avatars\/user_60_square.png",
        "city": "Valley Center, CA",
        "HDAvatar": ".\/img\/anon.jpg"
    }
]